package Homework1;

public class CyclesEx2 {
//    2) Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….
    public static void main(String[] args){
        for(int n = 90; n > 0; n -= 5 )
           System.out.println(n);
    }
}
